[
{"ninth most downloaded article": "Impossibility of distributed consensus with one faulty process", "first most downloaded article": "Robust principal component analysis?", "eight most downloaded article": "On the Complexity of the Orbit Problem", "third most downloaded article": "Scheduling Algorithms for Multiprogramming in a Hard-Real-Time Environment", "fourth most downloaded article": "Integer Programming Formulation of Traveling Salesman Problems", "available for download": 2817, "sixth most downloaded article": "The Power of Localization for Efficiently Learning Linear Separators with Noise", "fifth most downloaded article": "A Nearly Optimal Algorithm for Deciding Connectivity Queries in Smooth and Bounded Real Algebraic Sets", "publication years": "1954-2017", "seventh most downloaded article": "Reaching Agreement in the Presence of Faults", "publication count": 2817, "journal category": "Journal of the ACM (JACM)", "tenth most downloaded article": "Undirected single-source shortest paths with positive integer weights in linear time", "second most downloaded article": "Belief Propagation Guided Decimation Fails on Random Formulas", "total downloads": 2161495, "citation count": 86115, "journal category_description": "The  provides coverage of the most significant work on principles of computer science, broadly construed. The scope of research covered encompasses contributions of lasting value to any area of computer science. To be accepted, a paper must be judged to be truly outstanding in its field.  JACM is interested  in work in core computer science and in work at the boundaries, both the boundaries of subdisciplines of computer science and the boundaries between computer science and other fields."},
{"ninth most downloaded article": "Customizable Contraction Hierarchies", "first most downloaded article": "Space-Efficient Parallel Construction of Succinct Representations of Suffix Tree Topologies", "eight most downloaded article": "Experimental Evaluation of a Branch-and-Bound Algorithm for Computing Pathwidth and Directed Pathwidth", "third most downloaded article": "Implementing Efficient All Solutions SAT Solvers", "fourth most downloaded article": "A memetic algorithm to schedule planned maintenance for the national grid", "available for download": 287, "sixth most downloaded article": "In Memoriam: David S. Johnson", "fifth most downloaded article": "A Branch-Price-and-Cut Algorithm for Packing Cuts in Undirected Graphs", "publication years": "1996-2017", "seventh most downloaded article": "Lazy Lempel-Ziv Factorization Algorithms", "publication count": 287, "journal category": "Journal of Experimental Algorithmics (JEA)", "tenth most downloaded article": "Clique Counting in MapReduce: Algorithms and Experiments", "second most downloaded article": "Indexing methods for approximate dictionary searching: Comparative analysis", "total downloads": 149572, "citation count": 1556, "journal category_description": " is a high-quality journal devoted to the study of discrete algorithms and data structures from an empirical perspective. The journal welcomes original submissions that focus on design, implementation, and performance evaluation through a combination of experimentation and classical techniques."},
{"ninth most downloaded article": "A Survey on Systems Security Metrics", "first most downloaded article": "Anomaly detection: A survey", "eight most downloaded article": "A Survey of Authentication and Communications Security in Online Banking", "third most downloaded article": "Data clustering: a review", "fourth most downloaded article": "Connected Car: Technologies, Issues, Future Trends", "available for download": 1579, "sixth most downloaded article": "A Survey of Techniques for Approximate Computing", "fifth most downloaded article": "The Evolution of Android Malware and Android Analysis Techniques", "publication years": "1969-2017", "seventh most downloaded article": "Face recognition: A literature survey", "publication count": 1579, "journal category": "ACM Computing Surveys (CSUR)", "tenth most downloaded article": "Collaborative Filtering beyond the User-Item Matrix: A Survey of the State of the Art and Future Challenges", "second most downloaded article": "Machine learning in automated text categorization", "total downloads": 3077080, "citation count": 48419, "journal category_description": "These comprehensive, readable tutorials and survey papers give guided tours through the literature and explain topics to those who seek to learn the basics of areas outside their specialties.  The carefully planned and presented introductions in  are also an excellent way for professionals to develop perspectives on, and identify trends in complex technologies. Recent issues have covered image understanding, software reusability, and object and relational database topics."},
{"ninth most downloaded article": "On Local Expert Discovery via Geo-Located Crowds, Queries, and Candidates", "first most downloaded article": "Personalized Group Recommender Systems for Location- and Event-Based Social Networks", "eight most downloaded article": "Symbolic Trajectories", "third most downloaded article": "A Server-Assigned Spatial Crowdsourcing Framework", "fourth most downloaded article": "Efficient Processing of Relevant Nearest-Neighbor Queries", "available for download": 24, "sixth most downloaded article": "Social Influence-Aware Reverse Nearest Neighbor Search", "fifth most downloaded article": "Online Spatial Event Forecasting in Microblogs", "publication years": "2015-2016", "seventh most downloaded article": "Simulating Our LifeSteps by Example", "publication count": 24, "journal category": "ACM Transactions on Spatial Algorithms and Systems (TSAS)", "tenth most downloaded article": "Protecting Against Velocity-Based, Proximity-Based, and External Event Attacks in Location-Centric Social Networks", "second most downloaded article": "Matching Labels and Markers in Historical Maps: An Algorithm with Interactive Postprocessing", "total downloads": 3213, "citation count": 11, "journal category_description": " is a new scholarly journal that publishes high-quality papers on all aspects of spatial algorithms and systems and closely related disciplines. It has a multi-disciplinary perspective spanning a large number of areas where spatial data is manipulated or visualized (regardless of how it is specified - i.e., geometrically or textually), such as: geography, geographic information systems (GIS), geospatial and spatiotemporal databases, spatial and metric indexing, location-based services, web-based spatial applications, geographic information retrieval (GIR), spatial reasoning and mining, securing and privacy, as well as the related visual computing areas of computer graphics, computer vision, solid modeling, and visualization where the spatial, geospatial, and spatiotemporal data is central."},
{"ninth most downloaded article": "Dynamic Task Mapping with Congestion Speculation for Reconfigurable Network-on-Chip", "first most downloaded article": "A Framework for Evaluating and Optimizing FPGA-Based SoCs for Aerospace Computing", "eight most downloaded article": "A Microcoded Kernel Recursive Least Squares Processor Using FPGA Technology", "third most downloaded article": "Acceleration of k-Means Algorithm Using Altera SDK for OpenCL", "fourth most downloaded article": "Open-Source Variable-Precision Floating-Point Library for Major Commercial FPGAs", "available for download": 260, "sixth most downloaded article": "FPGA-Based Dynamically Reconfigurable SQL Query Processing", "fifth most downloaded article": "The Effect of Compiler Optimizations on High-Level Synthesis-Generated Hardware", "publication years": "2008-2016", "seventh most downloaded article": "A Fully Pipelined FPGA Architecture of a Factored Restricted Boltzmann Machine Artificial Neural Network", "publication count": 260, "journal category": "ACM Transactions on Reconfigurable Technology and Systems (TRETS)", "tenth most downloaded article": "Analysis of Fixed, Reconfigurable, and Hybrid Devices with Computational, Memory, I/O, & Realizable-Utilization Metrics", "second most downloaded article": "Automated Real-Time Analysis of Streaming Big and Dense Data on Reconfigurable Platforms", "total downloads": 72110, "citation count": 494, "journal category_description": " is a new journal focused on research in, on, and with reconfigurable systems and on the underlying technology (which is currently that of FPGAs but could include other approaches involving an adaptable fabric) that supports these systems for computing or other applications. Topics that would be appropriate for TRETS would include all levels of reconfigurable system abstractions and all aspects of reconfigurable technology including platforms, programming environments and application successes, such as: \r\n\r\n"},
{"ninth most downloaded article": "Radio link quality estimation in wireless sensor networks: A survey", "first most downloaded article": "Range-Free Mobile Actor Relocation in a Two-Tiered Wireless Sensor and Actor Network", "eight most downloaded article": "Gait-Key: A Gait-Based Shared Secret Key Generation Protocol for Wearable Devices", "third most downloaded article": "A System for Response and Prevention of Security Incidents in Wireless Sensor Networks", "fourth most downloaded article": "Encode When Necessary: Correlated Network Coding Under Unreliable Wireless Links", "available for download": 457, "sixth most downloaded article": "Sensor Network Provenance Compression Using Dynamic Bayesian Networks", "fifth most downloaded article": "Using mobile phones to determine transportation modes", "publication years": "2005-2017", "seventh most downloaded article": "Performance Assessment and Feasibility Analysis of IEEE 802.15.4m Wireless Sensor Networks in TV Grayspaces", "publication count": 457, "journal category": "ACM Transactions on Sensor Networks (TOSN)", "tenth most downloaded article": "Energy Harvesting and Wireless Transfer in Sensor Network Applications: Concepts and Experiences", "second most downloaded article": "Water Quality Monitoring Using Wireless Sensor Networks: Current Trends and Future Research Directions", "total downloads": 294396, "citation count": 3317, "journal category_description": "The  publishes research and applications of distributed, wireless or wireline sensor and actuator networks. As an interdisciplinary field, sensor networks draw upon many disciplines including signal processing, networking and protocols, embedded systems, information management, and distributed algorithms. Potential synergies among these fields are expected to open up new research directions.\n"},
{"ninth most downloaded article": "aToucan: An Automated Framework to Derive UML Analysis Models from Use Case Models", "first most downloaded article": "Two case studies of open source software development: Apache and Mozilla", "eight most downloaded article": "Dynamic Dependence Summaries", "third most downloaded article": "Using Cohesion and Coupling for Software Remodularization: Is It Enough?", "fourth most downloaded article": "Generating API Call Rules from Version History and Stack Overflow Posts", "available for download": 433, "sixth most downloaded article": "Does Automated Unit Test Generation Really Help Software Testers? A Controlled Empirical Study", "fifth most downloaded article": "The Effectiveness of Test Coverage Criteria for Relational Database Schema Integrity Constraints", "publication years": "1992-2017", "seventh most downloaded article": "Multi-Criteria Code Refactoring Using Search-Based Software Engineering: An Industrial Case Study", "publication count": 433, "journal category": "ACM Transactions on Software Engineering and Methodology (TOSEM)", "tenth most downloaded article": "Achieving scalable model-based testing through test case diversity", "second most downloaded article": "Impact-Driven Process Model Repair", "total downloads": 458403, "citation count": 10129, "journal category_description": "Designing and building a large, complex software system is a tremendous challenge.  publishes papers on all aspects of that challenge: specification, design, development and maintenance. It covers tools and methodologies, languages, data structures, and algorithms.  also reports on successful efforts, noting practical lessons that can be scaled and transferred to other projects, and often looks at applications of innovative technologies. The tone is scholarly but readable; the content is worthy of study; the presentation is effective."},
{"ninth most downloaded article": "Recommending friends and locations based on individual location history", "first most downloaded article": "The dynamics of viral marketing", "eight most downloaded article": "Comparison of collaborative filtering algorithms: Limitations of current techniques and proposals for scalable, high-performance recommender systems", "third most downloaded article": "From Footprint to Evidence: An Exploratory Study of Mining Social Data for Credit Scoring", "fourth most downloaded article": "Web Content Classification Using Distributions of Subjective Quality Evaluations", "available for download": 199, "sixth most downloaded article": "Manipulation among the Arbiters of Collective Intelligence: How Wikipedia Administrators Mold Public Opinion", "fifth most downloaded article": "Protecting browsers from DNS rebinding attacks", "publication years": "2007-2016", "seventh most downloaded article": "A Comprehensive Survey and Classification of Approaches for Community Question Answering", "publication count": 199, "journal category": "ACM Transactions on the Web (TWEB)", "tenth most downloaded article": "Progress on Website Accessibility?", "second most downloaded article": "Scanpath Trend Analysis on Web Pages: Clustering Eye Tracking Scanpaths", "total downloads": 172300, "citation count": 2120, "journal category_description": "\n"},
{"ninth most downloaded article": "Write Skew and Zipf Distribution: Evidence and Implications", "first most downloaded article": "Treating the Storage Stack Like a Network", "eight most downloaded article": "ImmortalGraph: A System for Storage and Analysis of Temporal Graphs", "third most downloaded article": "TrueErase: Leveraging an Auxiliary Data Path for Per-File Secure Deletion", "fourth most downloaded article": "Internal Parallelism of Flash Memory-Based Solid-State Drives", "available for download": 210, "sixth most downloaded article": "Improving Flash-Based Disk Cache with Lazy Adaptive Replacement", "fifth most downloaded article": "Isotope: ACID Transactions for Block Storage", "publication years": "2005-2017", "seventh most downloaded article": "Efficient Memory-Mapped I/O on Fast Storage Device", "publication count": 210, "journal category": "ACM Transactions on Storage (TOS)", "tenth most downloaded article": "DepSky: Dependable and Secure Storage in a Cloud-of-Clouds", "second most downloaded article": "BTRFS: The Linux B-Tree Filesystem", "total downloads": 139863, "citation count": 1443, "journal category_description": " is the first archival journal that deals with storage. The field of storage is one of the cornerstones for data availability. Storage is a broad and multidisciplinary area that comprises of network protocols, resource management, data backup, replication, recovery, devices, security, and theory of data coding, densities, and low-power. Designing and developing storage systems continues to be a challenge due to both software and hardware heterogeneity in enterprise environments and data centers. \n"},
{"ninth most downloaded article": "ThisType for Object-Oriented Languages: From Theory to Practice", "first most downloaded article": "The Byzantine Generals Problem", "eight most downloaded article": "A fast algorithm for finding dominators in a flowgraph", "third most downloaded article": "Polymorphic Manifest Contracts, Revised and Resolved", "fourth most downloaded article": "Efficiently computing static single assignment form and the control dependence graph", "available for download": 1032, "sixth most downloaded article": "Automatic verification of finite-state concurrent systems using temporal logic specifications", "fifth most downloaded article": "Linearizability: a correctness condition for concurrent objects", "publication years": "1979-2017", "seventh most downloaded article": "Analyzing Runtime and Size Complexity of Integer Programs", "publication count": 1032, "journal category": "ACM Transactions on Programming Languages and Systems (TOPLAS)", "tenth most downloaded article": "Generative communication in Linda", "second most downloaded article": "The Truth, The Whole Truth, and Nothing But the Truth: A Pragmatic Guide to Assessing Empirical Evaluations", "total downloads": 686743, "citation count": 31916, "journal category_description": " is the premier journal for reporting recent research advances in the areas of programming languages, and systems to assist the task of programming.  Papers can be either theoretical or experimental in style, but in either case, they must contain innovative and novel content that advances the state of the art of programming languages and systems. We also invite strictly experimental papers that compare existing approaches, as well as tutorial and survey papers.  The scope of TOPLAS includes, but is not limited to, the following subjects:\r\n"},
{"ninth most downloaded article": "The economics of information security investment", "first most downloaded article": "Return-Oriented Programming: Systems, Languages, and Applications", "eight most downloaded article": "Inhibiting and Detecting Offline Password Cracking Using ErsatzPasswords", "third most downloaded article": "Authentication Challenges in a Global Environment", "fourth most downloaded article": "Control-flow integrity principles, implementations, and applications", "available for download": 348, "sixth most downloaded article": "Enforceable security policies", "fifth most downloaded article": "Detection of Rogue Certificates from Trusted Certificate Authorities Using Deep Neural Networks", "publication years": "1998-2017", "seventh most downloaded article": "False data injection attacks against state estimation in electric power grids", "publication count": 348, "journal category": "ACM Transactions on Privacy and Security (TOPS)", "tenth most downloaded article": "Evaluating the Strength of Genomic Privacy Metrics", "second most downloaded article": "Designing Password Policies for Strength and Usability", "total downloads": 449055, "citation count": 8786, "journal category_description": " (formerly known as ) publishes high-quality research results in the fields of information and system security and privacy.  Studies addressing all aspects of these fields are welcomed, ranging from technologies, to systems and applications, to the crafting of policies. Topics of interest include:\r\n\r\n"},
{"ninth most downloaded article": "Lock Cohorting: A General Technique for Designing NUMA Locks", "first most downloaded article": "Fast Greedy Algorithms in MapReduce and Streaming", "eight most downloaded article": "Transparently Space Sharing a Multicore Among Multiple Processes", "third most downloaded article": "Trade-Offs Between Synchronization, Communication, and Computation in Parallel Linear Algebra Computations", "fourth most downloaded article": "Damaris: Addressing Performance Variability in Data Management for Post-Petascale Simulations", "available for download": 63, "sixth most downloaded article": "Hypergraph Partitioning for Sparse Matrix-Matrix Multiplication", "fifth most downloaded article": "Remote Memory Access Programming in MPI-3", "publication years": "2014-2016", "seventh most downloaded article": "Parallel Peeling Algorithms", "publication count": 63, "journal category": "ACM Transactions on Parallel Computing (TOPC)", "tenth most downloaded article": "Near-Optimal Scheduling Mechanisms for Deadline-Sensitive Jobs in Large Computing Clusters", "second most downloaded article": "High-Performance and Scalable GPU Graph Traversal", "total downloads": 10135, "citation count": 36, "journal category_description": "Parallel computing is no longer a niche research field but an essential ingredient in all aspects of computer science.  is a forum for novel and innovative work on all aspects of parallel computing, including foundational and theoretical aspects, systems, languages, architectures, tools, and applications. It will address all classes of parallel-processing platforms including concurrent, multithreaded, multicore, accelerated, multiprocessor, clusters, and supercomputers.  "},
{"ninth most downloaded article": "Towards systematic design of enterprise networks", "first most downloaded article": "Measurement study of Netflix, Hulu, and a tale of three CDNs", "eight most downloaded article": "On the levy-walk nature of human mobility", "third most downloaded article": "The Right Time: Reducing Effective End-to-End Delay in Time-Slotted Packet-Switched Networks", "fourth most downloaded article": "Privacy Preservation for Context Sensing on Smartphone", "available for download": 2697, "sixth most downloaded article": "Medium access control with coordinated adaptive sleeping for wireless sensor networks", "fifth most downloaded article": "The iSLIP scheduling algorithm for input-queued switches", "publication years": "1993-2016", "seventh most downloaded article": "On the self-similar nature of Ethernet traffic (extended version)", "publication count": 2697, "journal category": "IEEE/ACM Transactions on Networking (TON)", "tenth most downloaded article": "Analyzing the video popularity characteristics of large-scale user generated content systems", "second most downloaded article": "End-to-end available bandwidth: measurement methodology, dynamics, and relation with TCP throughput", "total downloads": 1060288, "citation count": 41337, "journal category_description": "Co-sponsored by ACM and the IEEE,  offers broad coverage of research and experience in network architecture and design, communication protocols, network software and technologies, services and applications, and network operations and management.  are available on the TON Home Page."},
{"ninth most downloaded article": "Parallel Memory-Efficient Adaptive Mesh Refinement on Structured Triangular Meshes with Billions of Grid Cells", "first most downloaded article": "GPOPS-II: A MATLAB Software for Solving Multiple-Phase Optimal Control Problems Using hp-Adaptive Gaussian Quadrature Collocation Methods and Sparse Nonlinear Programming", "eight most downloaded article": "Algorithm 971: An Implementation of a Randomized Algorithm for Principal Component Analysis", "third most downloaded article": "TetGen, a Delaunay-Based Quality Tetrahedral Mesh Generator", "fourth most downloaded article": "An Algorithm for Finding Best Matches in Logarithmic Expected Time", "available for download": 1490, "sixth most downloaded article": "Anatomy of high-performance matrix multiplication", "fifth most downloaded article": "TestU01: A C library for empirical testing of random number generators", "publication years": "1975-2017", "seventh most downloaded article": "Algorithm 778: L-BFGS-B: Fortran subroutines for large-scale bound-constrained optimization", "publication count": 1490, "journal category": "ACM Transactions on Mathematical Software (TOMS)", "tenth most downloaded article": "Sparse Matrix-Vector Multiplication on GPGPUs", "second most downloaded article": "The quickhull algorithm for convex hulls", "total downloads": 1003593, "citation count": 14151, "journal category_description": "As a scientific journal,  documents the theoretical underpinnings of numeric, symbolic, algebraic, and geometric computing applications. It focuses on analysis and construction of algorithms and programs, and the interaction of programs and architecture. Algorithms documented in  are available as the Collected Algorithms of the ACM at . "},
{"ninth most downloaded article": "Fairness and Incentive Considerations in Energy Apportionment Policies", "first most downloaded article": "Cocoa: Dynamic Container-Based Group Buying Strategies for Cloud Computing", "eight most downloaded article": "On Fair Attribution of Costs Under Peak-Based Pricing to Cloud Tenants", "third most downloaded article": "A Unified Approach to the Performance Analysis of Caching Systems", "fourth most downloaded article": "Analysis of an Offloading Scheme for Data Centers in the Framework of Fog Computing", "available for download": 27, "sixth most downloaded article": "Scheduling Storms and Streams in the Cloud", "fifth most downloaded article": "Contention-Aware Workload Placement for In-Memory Databases in Cloud Environments", "publication years": "2016-2017", "seventh most downloaded article": "Detecting Sponsored Recommendations", "publication count": 27, "journal category": "ACM Transactions on Modeling and Performance Evaluation of Computing Systems (TOMPECS)", "tenth most downloaded article": "Self-Similarity in Social Network Dynamics", "second most downloaded article": "PEAS: A Performance Evaluation Framework for Auto-Scaling Strategies in Cloud Applications", "total downloads": 2504, "citation count": 1, "journal category_description": "ACM Transactions on Modeling and Performance Evaluation of Computing Systems (ToMPECS) is a quarterly peer-reviewed journal that publishes refereed articles on all aspects of the modeling, analysis, and performance evaluation of computing and communication systems. It solicits and will publish articles that: \n\nTarget areas for these performance evaluation methodologies include traditional areas such as computer architecture, computer networks, database systems, distributed systems, enterprise systems, fault-tolerant systems, file and I/O systems, memory systems, multimedia systems, operating systems, peer-to-peer networks, real-time systems, sensor networks, software systems, storage systems, telecommunication networks, Web-based systems, and wireless networks, as well as up and coming areas such as data centers, green computing and communications, energy grid networks, on-line social networks, and networks at large. \n"},
{"ninth most downloaded article": "An Efficient Framework for Compressed Domain Watermarking in P Frames of High-Efficiency Video Coding (HEVC)--Encoded Video", "first most downloaded article": "Deep Learning at Scale and at Ease", "eight most downloaded article": "When Game Becomes Life: The Creators and Spectators of Online Game Replays and Live Streaming", "third most downloaded article": "Content-based multimedia information retrieval: State of the art and challenges", "fourth most downloaded article": "A survey of music similarity and recommendation from music context data", "available for download": 499, "sixth most downloaded article": "Evaluating the Privacy Risk of User-Shared Images", "fifth most downloaded article": "Learning from Collective Intelligence: Feature Learning Using Social Images and Tags", "publication years": "2005-2017", "seventh most downloaded article": "SAfeDJ: A Crowd-Cloud Codesign Approach to Situation-Aware Music Delivery for Drivers", "publication count": 500, "journal category": "ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM)", "tenth most downloaded article": "Identification of Reconstructed Speech", "second most downloaded article": "Procedural content generation for games: A survey", "total downloads": 230454, "citation count": 2783, "journal category_description": "The  focuses on multimedia computing (I/O devices, OS, storage systems, streaming media middleware, continuous media representations, media coding, media processing, etc.), multimedia communications (real-time protocols, end-to-end streaming media, resource allocation, multicast protocols, etc.), and multimedia applications (databases, distributed collaboration, video conferencing, 3D virtual environments, etc.).\r\n\r\nOn 23rd May 2014, ACM TOMCCAP changed its acronym to ACM TOMM. This acronym change was the result of extensive discussions between the journal Editorial Board and SIGMM constituents dating back to 2011.  This name change emphasizes the continued strong collaboration with the ACM Multimedia conference (ACMMM)."},
{"ninth most downloaded article": "Massive Parallelization of Serial Inference Algorithms for a Complex Generalized Linear Model", "first most downloaded article": "Mersenne twister: a 623-dimensionally equidistributed uniform pseudo-random number generator", "eight most downloaded article": "Fast simulation of rare events in queueing and reliability models", "third most downloaded article": "On the Marginal Standard Error Rule and the Testing of Initial Transient Deletion Methods", "fourth most downloaded article": "Real-Time Crowd Simulation Integrating Potential Fields and Agent Method", "available for download": 500, "sixth most downloaded article": "Monte Carlo Methods for Value-at-Risk and Conditional Value-at-Risk: A Review", "fifth most downloaded article": "Cycle-Accurate Network on Chip Simulation with Noxim", "publication years": "1991-2016", "seventh most downloaded article": "The stochastic root-finding problem: Overview, solutions, and open questions", "publication count": 500, "journal category": "ACM Transactions on Modeling and Computer Simulation (TOMACS)", "tenth most downloaded article": "MTSS -- A Marine Traffic Simulation System and Scenario Studies for a Major Hub Port", "second most downloaded article": "Research Challenges in Parallel and Distributed Simulation", "total downloads": 263470, "citation count": 4442, "journal category_description": "Systems modeling and computer simulation are powerful tools for understanding, and  is a primary source for research on all aspects of these two areas. Emphasizing discrete event simulation, this journal publishes applications, reviews, and tutorials on such topics as combined, distributed, and hybrid simulation, simulation and computer graphics, process generators, and random number generation."},
{"ninth most downloaded article": "Automated Quality Assessment of Metadata across Open Data Portals", "first most downloaded article": "EXPERIENCE: Succeeding at Data Management—BigCo Attempts to Leverage Data", "eight most downloaded article": "Reproducibility Challenges in Information Retrieval Evaluation", "third most downloaded article": "One Size Does Not Fit All---A Contingency Approach to Data Governance", "fourth most downloaded article": "From Content to Context: The Evolution and Growth of Data Quality Research", "available for download": 117, "sixth most downloaded article": "The Challenge of Test Data Quality in Data Processing", "fifth most downloaded article": "Challenges for Quality of Data in Smart Cities", "publication years": "2009-2017", "seventh most downloaded article": "Overview and Framework for Data and Information Quality Research", "publication count": 117, "journal category": "Journal of Data and Information Quality (JDIQ)", "tenth most downloaded article": "What Are the Most Important Factors for Accounting Information Quality and Their Impact on AIS Data Quality Outcomes?", "second most downloaded article": "An Introduction to Dynamic Data Quality Challenges", "total downloads": 74542, "citation count": 194, "journal category_description": ""},
{"ninth most downloaded article": "Password-Authenticated Group Key Exchange: A Cross-Layer Design", "first most downloaded article": "Internet of Things (IoT): Smart and Secure Service Delivery", "eight most downloaded article": "Secure Data-Centric Access Control for Smart Grid Services Based on Publish/Subscribe Systems", "third most downloaded article": "Intelligent Intrusion Detection in Low-Power IoTs", "fourth most downloaded article": "Processing Affect in Social Media: A Comparison of Methods to Distinguish Emotions in Tweets", "available for download": 292, "sixth most downloaded article": "Argumentation Mining: State of the Art and Emerging Trends", "fifth most downloaded article": "Authentication Protocol for an IoT-Enabled LTE Network", "publication years": "2001-2017", "seventh most downloaded article": "Brains or Beauty: How to Engender Trust in User-Agent Interactions", "publication count": 292, "journal category": "ACM Transactions on Internet Technology (TOIT)", "tenth most downloaded article": "Characterization of Wireless Multidevice Users", "second most downloaded article": "Advanced Security Testbed Framework for Wearable IoT Devices", "total downloads": 357790, "citation count": 3839, "journal category_description": " brings together many computing disciplines including computer software engineering, computer programming languages, middleware, database management, security, knowledge discovery and data mining, networking and distributed systems, communications, performance and scalability etc.  will cover the results and roles of the individual disciplines and the relationshipsamong them.\n"},
{"ninth most downloaded article": "Joint Modeling of User Check-in Behaviors for Real-time Point-of-Interest Recommendation", "first most downloaded article": "An iterative design methodology for user-friendly natural language office information applications", "eight most downloaded article": "Item-based top-", "third most downloaded article": "Overview of the Special Issue on Trust and Veracity of Information in Social Media", "fourth most downloaded article": "Textual analysis of stock market prediction using breaking financial news: The AZFin text system", "available for download": 653, "sixth most downloaded article": "Technological frames: making sense of information technology in organizations", "fifth most downloaded article": "Finding a happy medium: explaining the negative effects of electronic communication on social life at work", "publication years": "1983-2017", "seventh most downloaded article": "The integration of computing and routine work", "publication count": 653, "journal category": "ACM Transactions on Information Systems (TOIS)", "tenth most downloaded article": "Sentiment analysis in multiple languages: Feature selection for opinion classification in Web forums", "second most downloaded article": "Evaluating collaborative filtering recommender systems", "total downloads": 738964, "citation count": 20586, "journal category_description": "The  publishes papers on information retrieval (such as search engines, recommender systems) that contain:\r\n\r\nThe information retrieval scope of ACM Transactions on Information Systems (TOIS) appeals to industry practitioners for its wealth of creative ideas, and to academic researchers for its descriptions of their colleagues' work.\r\n"},
{"ninth most downloaded article": "Effective page refresh policies for Web crawlers", "first most downloaded article": "The entity-relationship model—toward a unified view of data", "eight most downloaded article": "The Grid File: An Adaptable, Symmetric Multikey File Structure", "third most downloaded article": "ARIES: a transaction recovery method supporting fine-granularity locking and partial rollbacks using write-ahead logging", "fourth most downloaded article": "Concurrency control performance modeling: alternatives and implications", "available for download": 940, "sixth most downloaded article": "Extending the Kernel of a Relational DBMS with Comprehensive Support for Sequenced Temporal Queries", "fifth most downloaded article": "Preference formulas in relational queries", "publication years": "1976-2017", "seventh most downloaded article": "Some high level language constructs for data of type relation", "publication count": 940, "journal category": "ACM Transactions on Database Systems (TODS)", "tenth most downloaded article": "Exact Model Counting of Query Expressions: Limitations of Propositional Methods", "second most downloaded article": "Smart Meter Data Analytics: Systems, Algorithms, and Benchmarking", "total downloads": 795441, "citation count": 30954, "journal category_description": "Heavily used in both academic and corporate R&D settings,  is a key publication for computer scientists working in data abstraction, data modeling, and designing data management systems. Topics include storage and retrieval, transaction management, distributed and federated databases, semantics of data, intelligent databases, and operations and algorithms relating to these areas. In this rapidly changing field,  provides insights into the thoughts of the best minds in database R&D."},
{"ninth most downloaded article": "Halftone QR codes", "first most downloaded article": "Image-space modal bases for plausible manipulation of objects in video", "eight most downloaded article": "Jump: virtual reality video", "third most downloaded article": "iWIRES: an analyze-and-edit approach to shape manipulation", "fourth most downloaded article": "Soli: ubiquitous gesture sensing with millimeter wave radar", "available for download": 2854, "sixth most downloaded article": ": an ultra-thin high performance monolithic camera array", "fifth most downloaded article": "360° video stabilization", "publication years": "1982-2017", "seventh most downloaded article": "Rig animation with a tangible and modular input device", "publication count": 2856, "journal category": "ACM Transactions on Graphics (TOG)", "tenth most downloaded article": "Downsampling scattering parameters for rendering anisotropic media", "second most downloaded article": "Street slide: browsing street level imagery", "total downloads": 3286408, "citation count": 81829, "journal category_description": " is the foremost peer-reviewed journal in graphics field. In the colorful pages of , leading researchers discuss breakthroughs in computer-aided design, synthetic image generation, rendering, solid modeling and other areas. \"Research,\" the largest regular section, is necessary intellectual nourishment for anyone implementing graphics systems."},
{"ninth most downloaded article": "A MATLAB Vectorizing Compiler Targeting Application-Specific Instruction Set Processors", "first most downloaded article": "Hardware Trojans: Lessons Learned after One Decade of Research", "eight most downloaded article": "Multiprocessor Scheduling of a Multi-Mode Dataflow Graph Considering Mode Transition Delay", "third most downloaded article": "Security Analysis of Arbiter PUF and Its Lightweight Compositions Under Predictability Test", "fourth most downloaded article": "Power Modeling for GPU Architectures Using McPAT", "available for download": 899, "sixth most downloaded article": "Scrubbing Mechanism for Heterogeneous Applications in Reconfigurable Devices", "fifth most downloaded article": "Security-Aware Design Methodology and Optimization for Automotive Systems", "publication years": "1996-2017", "seventh most downloaded article": "A Model-Driven Engineering Methodology to Design Parallel and Distributed Embedded Systems", "publication count": 899, "journal category": "ACM Transactions on Design Automation of Electronic Systems (TODAES)", "tenth most downloaded article": "A Hybrid DRAM/PCM Buffer Cache Architecture for Smartphones with QoS Consideration", "second most downloaded article": "Worst-Case Response Time Analysis of a Synchronous Dataflow Graph in a Multiprocessor System with Real-Time Tasks", "total downloads": 362976, "citation count": 4279, "journal category_description": " is a new CAD publication emphasizing a computer science/engineering orientation.   contains a varied array of article formats, including research papers, tutorial and survey papers, as well as short technical notes. Let this new reference tool be your pulse to the rapidly changing field of design technology of electronic systems."},
{"ninth most downloaded article": "Compressed matrix multiplication", "first most downloaded article": "(Leveled) Fully Homomorphic Encryption without Bootstrapping", "eight most downloaded article": "Relative Discrepancy Does Not Separate Information and Communication Complexity", "third most downloaded article": "Small Depth Proof Systems", "fourth most downloaded article": "Space-Efficient Approximations for Subset Sum", "available for download": 108, "sixth most downloaded article": "Nondeterminism and An Abstract Formulation of Ne&ccaron;iporuk’s Lower Bound Method", "fifth most downloaded article": "Noncommutative Valiant's Classes: Structure and Complete Problems", "publication years": "2009-2016", "seventh most downloaded article": "Algebrization: A New Barrier in Complexity Theory", "publication count": 108, "journal category": "ACM Transactions on Computation Theory (TOCT)", "tenth most downloaded article": "Limitations of Deterministic Auction Design for Correlated Bidders", "second most downloaded article": "On Hardness of Multilinearization and VNP-Completeness in Characteristic 2", "total downloads": 18345, "citation count": 147, "journal category_description": " is a scholarly journal publishing outstanding original research that explores the mathematical nature of computation, and its theoretical limitations.  Topics include, but are not limited to, computational complexity, foundations of cryptography, randomness in computing, coding theory, models of computation including parallel, distributed and quantum and other emerging models, computational learning theory, theoretical computer science aspects of areas such as databases, information retrieval, economic models and networks."},
{"ninth most downloaded article": "L4 Microkernels: The Lessons from 20 Years of Research and Deployment", "first most downloaded article": "Spanner: Google’s Globally Distributed Database", "eight most downloaded article": "Implementing remote procedure calls", "third most downloaded article": "The RAMCloud Storage System", "fourth most downloaded article": "End-to-end arguments in system design", "available for download": 447, "sixth most downloaded article": "Algorithms for scalable synchronization on shared-memory multiprocessors", "fifth most downloaded article": "Arrakis: The Operating System Is the Control Plane", "publication years": "1983-2017", "seventh most downloaded article": "The design and implementation of a log-structured file system", "publication count": 447, "journal category": "ACM Transactions on Computer Systems (TOCS)", "tenth most downloaded article": "TaintDroid: An Information-Flow Tracking System for Realtime Privacy Monitoring on Smartphones", "second most downloaded article": "Bigtable: A Distributed Storage System for Structured Data", "total downloads": 584624, "citation count": 20761, "journal category_description": " presents research and development results on the design, specification, realization, behavior, and use of computer systems. The term \"computer systems\" is interpreted broadly and includes systems architectures, operating systems, distributed systems, and computer networks. Articles that appear in TOCS will tend either to present new techniques and concepts or to report on experiences and experiments with actual systems. Insights useful to system designers, builders, and users will be emphasized."},
{"ninth most downloaded article": "Reasoning About Strategies: On the Model-Checking Problem", "first most downloaded article": "A theory of normed simulations", "eight most downloaded article": "The DLV system for knowledge representation and reasoning", "third most downloaded article": "Abstract Program Slicing: An Abstract Interpretation-Based Approach to Program Slicing", "fourth most downloaded article": "Automated Verification of Equivalence Properties of Cryptographic Protocols", "available for download": 462, "sixth most downloaded article": "Complexity of Two-Variable Logic on Finite Trees", "fifth most downloaded article": "Differential Game Logic", "publication years": "2000-2017", "seventh most downloaded article": "A Hoare Logic for GPU Kernels", "publication count": 462, "journal category": "ACM Transactions on Computational Logic (TOCL)", "tenth most downloaded article": "Extending two-variable logic on data trees with order on data values and its automata", "second most downloaded article": "Parametrised Complexity of Satisfiability in Temporal Logic", "total downloads": 135876, "citation count": 4671, "journal category_description": " is devoted to research concerned with all uses of logic in computer science.\n\nLogic continues to play an important role in computer science and permeates  many of its areas including: artificial intelligence, computational complexity, database systems and programming languages."},
{"ninth most downloaded article": "All You Need is Love: Current Strategies of Mediating Intimate Relationships through Technology", "first most downloaded article": "Peer and self assessment in massive online classes", "eight most downloaded article": "Using Mobile Eye-Trackers to Unpack the Perceptual Benefits of a Tangible User Interface for Collaborative Learning", "third most downloaded article": "Distributed cognition: toward a new foundation for human-computer interaction research", "fourth most downloaded article": "Internet Censorship in China: Examining User Awareness and Attitudes", "available for download": 481, "sixth most downloaded article": "Past, present, and future of user interface software tools", "fifth most downloaded article": "Colors -- Messengers of Concepts: Visual Design Mining for Learning Color Semantics", "publication years": "1994-2017", "seventh most downloaded article": "The anatomy of prototypes: Prototypes as filters, prototypes as manifestations of design ideas", "publication count": 481, "journal category": "ACM Transactions on Computer-Human Interaction (TOCHI)", "tenth most downloaded article": "Teaching and Developing Social and Emotional Skills with Technology", "second most downloaded article": "Crowdfunding: Motivations and deterrents for participation", "total downloads": 742637, "citation count": 11674, "journal category_description": " covers the software, hardware and human aspects of interaction with computers. Topics include hardware and software architectures; interactive techniques, metaphors, and evaluation; user interface design processes; and users and groups of users. Those within the artificial intelligence, object-oriented systems, information systems, graphics and software engineering communities, will benefit from the high quality research papers in  concerning information and ideas directly related to the construction of effective human-computer interfaces."},
{"ninth most downloaded article": "Computer Science Education for Primary and Lower Secondary School Students: Teaching the Concept of Automata", "first most downloaded article": "Notional machines and introductory programming education", "eight most downloaded article": "The Scratch Programming Language and Environment", "third most downloaded article": "An Empirical Investigation into Programming Language Syntax", "fourth most downloaded article": "Measuring and Understanding Team Development by Capturing Self-assessed Enthusiasm and Skill Levels", "available for download": 292, "sixth most downloaded article": "From Scratch to “Real” Programming", "fifth most downloaded article": "Computational Thinking in Elementary and Secondary Teacher Education", "publication years": "2001-2017", "seventh most downloaded article": "A Case Study of the Introduction of Computer Science in NZ Schools", "publication count": 293, "journal category": "ACM Transactions on Computing Education (TOCE)", "tenth most downloaded article": "A Review of Generic Program Visualization Systems for Introductory Programming Education", "second most downloaded article": "Flipping and Blending—An Action Research Project on Improving a Functional Programming Course", "total downloads": 276215, "citation count": 1772, "journal category_description": " (formerly named JERIC, Journal on Educational Resources in Computing) covers diverse aspects of computing education: traditional computer science, computer engineering, information technology, and informatics; emerging aspects of computing; and applications of computing to other disciplines. The common characteristics shared by these papers are a scholarly approach to teaching and learning, a broad appeal to educational practitioners, and a clear connection to student learning."},
{"ninth most downloaded article": "Discovering Finance Keywords via Continuous-Space Language Models", "first most downloaded article": "The Netflix Recommender System: Algorithms, Business Value, and Innovation", "eight most downloaded article": "Toward a broader vision for Information Systems", "third most downloaded article": "A Systematic Review of Business and Information Technology Alignment", "fourth most downloaded article": "Understanding Business Ecosystem Dynamics: A Data-Driven Approach", "available for download": 125, "sixth most downloaded article": "Are Sponsored Links Effective? Investigating the Impact of Trust in Search Engine Advertising", "fifth most downloaded article": "A Double-Layer Neural Network Framework for High-Frequency Forecasting", "publication years": "2010-2017", "seventh most downloaded article": "On Optimal Employee Assignment in Constrained Role-Based Access Control Systems", "publication count": 125, "journal category": "ACM Transactions on Management Information Systems (TMIS)", "tenth most downloaded article": "Business Intelligence and Analytics Education, and Program Development: A Unique Opportunity for the Information Systems Discipline", "second most downloaded article": "Business Intelligence and Analytics: Research Directions", "total downloads": 90971, "citation count": 325, "journal category_description": " publishes the highest quality papers about the design, development, assessment, and management of information technology and systems within organizations, businesses, and societies. In addition to traditional management and behavioral MIS research, ACM TMIS strongly encourages submissions of high-quality system and design science research, as well as submissions in emerging MIS multidisciplinary research topics that may span several traditional academic disciplines."},
{"ninth most downloaded article": "User Vulnerability and Its Reduction on a Social Networking Site", "first most downloaded article": "Clustering high-dimensional data: A survey on subspace clustering, pattern-based clustering, and correlation clustering", "eight most downloaded article": "Adaptive Cluster Tendency Visualization and Anomaly Detection for Streaming Data", "third most downloaded article": "Scalable and Accurate Online Feature Selection for Big Data", "fourth most downloaded article": "Structural Analysis of User Choices for Mobile App Recommendation", "available for download": 272, "sixth most downloaded article": "Shop-Type Recommendation Leveraging the Data from Social Media and Location-Based Services", "fifth most downloaded article": "-diversity: Privacy beyond ", "publication years": "2007-2016", "seventh most downloaded article": "Greedily Improving Our Own Closeness Centrality in a Network", "publication count": 272, "journal category": "ACM Transactions on Knowledge Discovery from Data (TKDD)", "tenth most downloaded article": "Distributed Algorithms for Computing Very Large Thresholded Covariance Matrices", "second most downloaded article": "Hierarchical Density Estimates for Data Clustering, Visualization, and Outlier Detection", "total downloads": 187493, "citation count": 2388, "journal category_description": " welcomes papers on a full range of research in the knowledge discovery and analysis of diverse forms of data.   Such subjects include: scalable and effective algorithms for data mining and data warehousing, mining data streams, mining multi-media data, mining high-dimensional data, mining text, Web, and semi-structured data, mining spatial and temporal data, data mining for community generation, social network analysis, and graph structured data, security and privacy issues in data mining, visual, interactive and online data mining, pre-processing and post-processing for data mining, robust and scalable statistical methods, data mining languages, foundations of data mining, KDD framework and process, and novel applications and infrastructures exploiting data mining technology.  TKDD encourages papers that explore the above subjects in the context of large distributed networks of computers, parallel or multiprocessing computers, or new data devices.  TKDD also encourages papers that describe emerging data mining applications that cannot be satisfied by the current data mining technology."},
{"ninth most downloaded article": "SNAP: A General-Purpose Network Analysis and Graph-Mining Library", "first most downloaded article": "LIBSVM: A library for support vector machines", "eight most downloaded article": "Using Scalable Data Mining for Predicting Flight Delays", "third most downloaded article": "Trajectory Data Mining: An Overview", "fourth most downloaded article": "Factorization Machines with libFM", "available for download": 444, "sixth most downloaded article": "Urban Computing: Concepts, Methodologies, and Applications", "fifth most downloaded article": "Learning ", "publication years": "2010-2017", "seventh most downloaded article": "A Comprehensive Survey on Pose-Invariant Face Recognition", "publication count": 444, "journal category": "ACM Transactions on Intelligent Systems and Technology (TIST)", "tenth most downloaded article": "A survey of appearance models in visual object tracking", "second most downloaded article": "Tensors for Data Mining and Data Fusion: Models, Applications, and Scalable Algorithms", "total downloads": 199097, "citation count": 5164, "journal category_description": " publishes the highest quality papers on intelligent systems, applicable algorithms and technology with a multi-disciplinary perspective. An intelligent system is one that uses artificial intelligence (AI) techniques to offer important services (e.g., as a component of a larger system) to allow integrated systems to perceive, reason, learn, and act intelligently in the real world."},
{"ninth most downloaded article": "Common Sense Reasoning for Detection, Prevention, and Mitigation of Cyberbullying", "first most downloaded article": "Diversity, Serendipity, Novelty, and Coverage: A Survey and Empirical Analysis of Beyond-Accuracy Objectives in Recommender Systems", "eight most downloaded article": "Effects of the Advisor and Environment on Requesting and Complying With Automated Advice", "third most downloaded article": "Introduction to the Special Issue on Human Interaction with Artificial Advice Givers", "fourth most downloaded article": "Modeling User Preferences in Recommender Systems: A Classification Framework for Explicit and Implicit User Feedback", "available for download": 143, "sixth most downloaded article": "A User Perception--Based Approach to Create Smiling Embodied Conversational Agents", "fifth most downloaded article": "Updatable, Accurate, Diverse, and Scalable Recommendations for Interactive Applications", "publication years": "2011-2017", "seventh most downloaded article": "AutoTutor and affective autotutor: Learning by talking with cognitively and emotionally intelligent computers that talk back", "publication count": 143, "journal category": "ACM Transactions on Interactive Intelligent Systems (TiiS)", "tenth most downloaded article": "Conversational gaze mechanisms for humanlike robots", "second most downloaded article": "The MovieLens Datasets: History and Context", "total downloads": 50044, "citation count": 478, "journal category_description": "The  publishes papers on research concerning the design, realization, or evaluation of interactive systems that incorporate some form of machine intelligence. TIIS articles come from a wide range of research areas and communities. An article can take any of several complementary views of interactive intelligent systems, focusing on: "},
{"ninth most downloaded article": "Binary Opinion Dynamics with Stubborn Agents", "first most downloaded article": "When Does Improved Targeting Increase Revenue?", "eight most downloaded article": "To Match or Not to Match: Economics of Cookie Matching in Online Advertising", "third most downloaded article": "Deconstructing Amazon EC2 Spot Instance Pricing", "fourth most downloaded article": "A Rational Convex Program for Linear Arrow-Debreu Markets", "available for download": 99, "sixth most downloaded article": "The AND-OR Game", "fifth most downloaded article": "Incentives, Gamification, and Game Theory: An Economic Approach to Badge Design", "publication years": "2013-2016", "seventh most downloaded article": "Dynamic Pricing with Limited Supply", "publication count": 99, "journal category": "ACM Transactions on Economics and Computation (TEAC)", "tenth most downloaded article": "Do Capacity Constraints Constrain Coalitions?", "second most downloaded article": "Risk Sensitivity of Price of Anarchy under Uncertainty", "total downloads": 15356, "citation count": 142, "journal category_description": "The  is a new journal focusing on the intersection of computer science and economics. Of interest to the journal is any topic relevant to both economists and computer scientists, including but not limited to the following: algorithmic game theory, mechanism design, design and analysis of electronic markets, computation of equilibria, cost of strategic behavior and cost of decentralization, learning in games and markets, systems resilient against malicious agents, economics of computational advertising, paid search auctions, agents in networks, electronic commerce, computational social choice, recommendation/reputation/trust systems, and privacy.  The journal will appear towards the end of 2012."},
{"ninth most downloaded article": "Bluetooth aided mobile phone localization: A nonlinear neural circuit approach", "first most downloaded article": "Survey of Stochastic Computing", "eight most downloaded article": "Why Data Deletion Fails? A Study on Deletion Flaws and Data Remanence in Android Systems", "third most downloaded article": "The worst-case execution-time problem—overview of methods and survey of tools", "fourth most downloaded article": "Power management in energy harvesting sensor networks", "available for download": 933, "sixth most downloaded article": "Protecting Mobile Health Records in Cloud Computing: A Secure, Efficient, and Anonymous Design", "fifth most downloaded article": "LegUp: An open-source high-level synthesis tool for FPGA-based processor/accelerator systems", "publication years": "2002-2017", "seventh most downloaded article": "Embedded Device Forensics and Security", "publication count": 934, "journal category": "ACM Transactions on Embedded Computing Systems (TECS)", "tenth most downloaded article": "Simulating Reconfigurable Multiprocessor Systems-on-Chip with MPSoCSim", "second most downloaded article": "Security in embedded systems: Design challenges", "total downloads": 436150, "citation count": 4376, "journal category_description": "The design of embedded computing systems, both the software and hardware, increasingly relies on sophisticated algorithms, analytical models, and methodologies.  aims to present the leading work relating to the analysis, design, behavior, and experience with embedded computing systems."},
{"ninth most downloaded article": "Collaborative Load Management with Safety Assurance in Smart Grids", "first most downloaded article": "Fundamental Limits of Cyber-Physical Systems Modeling", "eight most downloaded article": "Last-Mile Transit Service with Urban Infrastructure Data", "third most downloaded article": "Research Directions for Cyber Physical Systems in Wireless and Mobile Healthcare", "fourth most downloaded article": "Design and Realization of WInternet: From Net of Things to Internet of Things", "available for download": 13, "sixth most downloaded article": "Minimizing Transmission Loss in Smart Microgrids by Sharing Renewable Energy", "fifth most downloaded article": "Heterogeneous Model Integration for Multi-Source Urban Infrastructure Data", "publication years": "2017-2017", "seventh most downloaded article": "Event-Based Mobility Modeling and Analysis", "publication count": 13, "journal category": "ACM Transactions on Cyber-Physical Systems", "tenth most downloaded article": "Adaptive Real-Time Communication for Wireless Cyber-Physical Systems", "second most downloaded article": "Security, Privacy, and Safety Aspects of Civilian Drones: A Survey", "total downloads": 1222, "citation count": 0, "journal category_description": " is the premier journal for the publication of high-quality original research papers and survey papers that have scientific and technological understanding of the interactions of information processing, networking and physical processes. TCPS will cover the following topics: \r\n\r\nThe application domains covered by TCPS include, but not limited to: Healthcare, Transportation, Automotive, Avionics, Energy, Living Space, and Robotics.\r\n"},
{"ninth most downloaded article": "Biomarker signature discovery from mass spectrometry data", "first most downloaded article": "Biclustering Algorithms for Biological Data Analysis: A Survey", "eight most downloaded article": "Indexing graphs for path queries with applications in genome research", "third most downloaded article": "Integrative data analysis of multi-platform cancer data with a multimodal deep learning approach", "fourth most downloaded article": "Emerging security mechanisms for medical cyber physical systems", "available for download": 1228, "sixth most downloaded article": "A deep learning network approach to ab initio protein secondary structure prediction", "fifth most downloaded article": "Computational 3D Assembling Methods for DNA: A Survey", "publication years": "2004-2016", "seventh most downloaded article": "A New Approach for Feature Selection from Microarray Data Based on Mutual Information", "publication count": 1229, "journal category": "IEEE/ACM Transactions on Computational Biology and Bioinformatics (TCBB)", "tenth most downloaded article": "A New Efficient Algorithm for the All Sorting Reversals Problem with No Bad Components", "second most downloaded article": "Data Mining in Systems Biology", "total downloads": 209875, "citation count": 3648, "journal category_description": " is a bimonthly journal that publishes archival research results related to the algorithmic, mathematical, statistical, and computational methods that are central in bioinformatics and computational biology; the development and testing of effective computer programs in bioinformatics; the development and optimization of biological databases; and important biological results that are obtained from the use of these methods, programs, and databases."},
{"ninth most downloaded article": "Context-Dependent Piano Music Transcription With Convolutional Sparse Coding", "first most downloaded article": "Deep sentence embedding using long short-term memory networks: analysis and application to information retrieval", "eight most downloaded article": "Automatic expressive opinion sentence generation for enjoyable conversational systems", "third most downloaded article": "Convolutional neural networks for speech recognition", "fourth most downloaded article": "Data augmentation for deep neural network acoustic modeling", "available for download": 556, "sixth most downloaded article": "Application of Deep Belief Networks for natural language understanding", "fifth most downloaded article": "On training targets for supervised speech separation", "publication years": "2014-2016", "seventh most downloaded article": "Very Deep Convolutional Neural Networks for Noise Robust Speech Recognition", "publication count": 556, "journal category": "IEEE/ACM Transactions on Audio, Speech and Language Processing (TASLP)", "tenth most downloaded article": "An overview of noise-robust automatic speech recognition", "second most downloaded article": "A regression approach to speech enhancement based on deep neural networks", "total downloads": 24334, "citation count": 424, "journal category_description": "The  covers audio, speech and language  processing and the sciences that support them. It includes practical areas of the design, development, and evaluation of speech- and text-processing systems along with their associated theory. It publishes application-oriented research, survey papers, and descriptions of novel applications. Audio processing topics include: transducers, room acoustics, active sound control, human audition, analysis/synthesis/coding of music, and consumer audio. Speech processing topics include: speech analysis, synthesis, coding, speech and speaker recognition, speech production and perception, and speech enhancement. Language processing topics include: speech and text analysis, understanding, generation, dialog management, translation, summarization, question answering and document indexing and retrieval, as well as general language modeling. Machine learning and pattern analysis applied to any of the above areas is also welcome.\r\n has launched. The new journal is a merge of  and . Papers from the new Transactions appear in both IEEE Xplore and the ACM Digital Library."},
{"ninth most downloaded article": "Subjective and Objective Visual Quality Assessment of Textured 3D Meshes", "first most downloaded article": "Walking in Virtual Reality: Effects of Manipulated Visual Self-Motion on Walking Biomechanics", "eight most downloaded article": "Evaluation of spatial displays for navigation without sight", "third most downloaded article": "Waypoint navigation with a vibrotactile waist belt", "fourth most downloaded article": "Assessing the Impact of Hand Motion on Virtual Character Personality", "available for download": 337, "sixth most downloaded article": "Deformation Lamps: A Projection Technique to Make Static Objects Perceptually Dynamic", "fifth most downloaded article": "Summary Statistics and Material Categorization in the Visual Periphery", "publication years": "2004-2017", "seventh most downloaded article": "Vertical Field-of-View Extension and Walking Characteristics in Head-Worn Virtual Environments", "publication count": 337, "journal category": "ACM Transactions on Applied Perception (TAP)", "tenth most downloaded article": "The Effects of Visuomotor Calibration to the Perceived Space and Body, through Embodiment in Immersive Virtual Reality", "second most downloaded article": "Gazing and frowning as a new human--computer interaction technique", "total downloads": 162971, "citation count": 1635, "journal category_description": " aims to broaden the synergy between computer science and psychology/perception by publishing top quality papers that help to unify research in these fields. The journal publishes inter-disciplinary research of significant and lasting value in all subfields of Computer Science and Experimental Psychology. All papers must incorporate both perceptual and computer science components. Topics include, but are not limited to: \n"},
{"ninth most downloaded article": "A Semisupervised Tag-Transition-Based Markovian Model for Uyghur Morphology Analysis", "first most downloaded article": "Comparison Study on Critical Components in Composition Model for Phrase Representation", "eight most downloaded article": "An evaluation of statistical spam filtering techniques", "third most downloaded article": "Word Segmentation for Burmese (Myanmar)", "fourth most downloaded article": "Web Search Clustering and Labeling with Hidden Topics", "available for download": 300, "sixth most downloaded article": "Preordering using a Target-Language Parser via Cross-Language Syntactic Projection for Statistical Machine Translation", "fifth most downloaded article": "Improving Transition-Based Dependency Parsing of Hindi and Urdu by Modeling Syntactically Relevant Phenomena", "publication years": "2002-2017", "seventh most downloaded article": "Converting Continuous-Space Language Models into ", "publication count": 300, "journal category": "ACM Transactions on Asian and Low-Resource Language Information Processing (TALLIP)", "tenth most downloaded article": "Arabic Natural Language Processing: Challenges and Solutions", "second most downloaded article": "Named Entity Recognition with Word Embeddings and Wikipedia Categories for a Low-Resource Language", "total downloads": 121183, "citation count": 1078, "journal category_description": "The  publishes high quality original archival papers and technical notes in the areas of computation and processing of information in Asian languages, low-resource languages of Africa, Australasia, Oceania and the Americas, as well as related disciplines. The subject areas covered by TALLIP include, but are not limited to:\n\nPapers that deal in theory, systems design, evaluation and applications in the aforesaid subjects are appropriate for TALLIP. Emphasis will be placed on the originality and the practical significance of the reported research.\nIn addition, papers published in TALLIP must relate to some aspect of Asian language or speech processing. Asian languages include languages in East Asia (e.g. Chinese, Japanese, Korean), South Asia (Hindi, Tamil, etc), Southeast Asia (Malay, Thai, Vietnamese, etc), the Middle East (Arabic, etc), and so on. Low-resource languages of primary interest are those of Africa, Australasia, Oceania, the Americas and, of course, Asia.\n"},
{"ninth most downloaded article": "Fast sparse matrix multiplication", "first most downloaded article": "On Uniform Capacitated ", "eight most downloaded article": "2-Edge Connectivity in Directed Graphs", "third most downloaded article": "Generating Random Permutations by Coin Tossing: Classical Algorithms, New Analysis, and Modern Implementation", "fourth most downloaded article": "A New Approach to Online Scheduling: Approximating the Optimal Competitive Ratio", "available for download": 548, "sixth most downloaded article": "How Good Is Multi-Pivot Quicksort?", "fifth most downloaded article": "Dynamic Facility Location via Exponential Clocks", "publication years": "2005-2017", "seventh most downloaded article": "Nearest-Neighbor Searching Under Uncertainty II", "publication count": 548, "journal category": "ACM Transactions on Algorithms (TALG)", "tenth most downloaded article": "A Simple and Efficient Algorithm for Computing Market Equilibria", "second most downloaded article": "Cache-Oblivious Algorithms", "total downloads": 212791, "citation count": 3292, "journal category_description": "The  publishes original research of the highest quality dealing with algorithms that are inherently discrete and finite, and having mathematical content in a natural way, either in the objective or in the analysis. Most welcome are new algorithms and data structures, new and improved analyses, and complexity results. In addition to original research articles TALG will include special features appearing from time to time such as invited columns and a problems section.\n"},
{"ninth most downloaded article": "Cooperative Caching for GPUs", "first most downloaded article": "Hardware-Accelerated Cross-Architecture Full-System Virtualization", "eight most downloaded article": "UMH: A Hardware-Based Unified Memory Hierarchy for Systems with Multiple Discrete GPUs", "third most downloaded article": "MAMBO: A Low-Overhead Dynamic Binary Modification Tool for ARM", "fourth most downloaded article": "Static and Dynamic Frequency Scaling on Multicore CPUs", "available for download": 506, "sixth most downloaded article": "Optimizing Indirect Branches in Dynamic Binary Translators", "fifth most downloaded article": "Synergistic Analysis of Evolving Graphs", "publication years": "2004-2016", "seventh most downloaded article": "AIM: Energy-Efficient Aggregation Inside the Memory Hierarchy", "publication count": 506, "journal category": "ACM Transactions on Architecture and Code Optimization (TACO)", "tenth most downloaded article": "Simultaneous Multi-Layer Access: Improving 3D-Stacked Memory Bandwidth at Low Cost", "second most downloaded article": "A Software Cache Partitioning System for Hash-Based Caches", "total downloads": 202060, "citation count": 1899, "journal category_description": " focuses on hardware, software, and system research spanning the fields of computer architecture and code optimization. Articles that appear in TACO will either present new techniques and concepts or report on experiences and experiments with actual systems. Insights useful to architects, hardware or software developers, designers, builders, and users will be emphasized. \n\n"},
{"ninth most downloaded article": "Ability-Based Design: Concept, Principles and Examples", "first most downloaded article": "ACE: A Colour Palette Design Tool for Balancing Aesthetics and Accessibility", "eight most downloaded article": "Skin Conductance as an ", "third most downloaded article": "Accessible Touchscreen Technology for People with Visual Impairments: A Survey", "fourth most downloaded article": "The Effect of Font Type on Screen Readability by People with Dyslexia", "available for download": 124, "sixth most downloaded article": "Investigating the Implications of 3D Printing in Special Education", "fifth most downloaded article": "How Older Adults Learn to Use Mobile Devices: Survey and Field Investigations", "publication years": "2008-2017", "seventh most downloaded article": "Evaluating a Collaborative iPad Game's Impact on Social Relationships for Children with Autism Spectrum Disorder", "publication count": 124, "journal category": "ACM Transactions on Accessible Computing (TACCESS)", "tenth most downloaded article": "A Pool of Representative Users for Accessibility Research: Seeing through the Eyes of the Users", "second most downloaded article": "Multimodal Perception of Histological Images for Persons Who Are Blind or Visually Impaired", "total downloads": 51110, "citation count": 523, "journal category_description": " is a quarterly journal that publishes refereed articles addressing issues of computing as it impacts the lives of people with disabilities. It provides a technical forum for disseminating innovative research that covers either: "},
{"ninth most downloaded article": "Agile dynamic provisioning of multi-tier Internet applications", "first most downloaded article": "Self-adaptive software: Landscape and research challenges", "eight most downloaded article": "Designing Adaptive Applications Deployed on Cloud Environments", "third most downloaded article": "Privacy Policy Negotiation in Social Media", "fourth most downloaded article": "Characterizing and Adapting the Consistency-Latency Tradeoff in Distributed Key-Value Stores", "available for download": 255, "sixth most downloaded article": "Topology Control for Self-Adaptation in Wireless Sensor Networks with Temporary Connection Impairment", "fifth most downloaded article": "Formal Design and Verification of Self-Adaptive Systems with Decentralized Control", "publication years": "2006-2017", "seventh most downloaded article": "A survey of autonomic communications", "publication count": 255, "journal category": "ACM Transactions on Autonomous and Adaptive Systems (TAAS)", "tenth most downloaded article": "A Support System for Clustering Data Streams with a Variable Number of Clusters", "second most downloaded article": "Control Strategies for Self-Adaptive Software Systems", "total downloads": 122039, "citation count": 1459, "journal category_description": " is a venue for high-quality research contributions addressing foundational, engineering, and technological aspects related to all those complex ICT systems that have to serve - in autonomy and with capabilities of autonomous adaptation - in highly dynamic socio-technico-physical environments.TAAS addresses research on autonomous and adaptive systems being undertaken by an increasingly interdisciplinary research community -- and provide a common platform under which this work can be published and disseminated. TAAS encourages contributions aimed at supporting the understanding, development, and control of such systems and of their behaviors. "},
{"ninth most downloaded article": "Visual Recognition of Ancient Inscriptions Using Convolutional Neural Network and Fisher Vector", "first most downloaded article": "The Digital Music Lab: A Big Data Infrastructure for Digital Musicology", "eight most downloaded article": "The European Holocaust Research Infrastructure Portal", "third most downloaded article": "The MIT Museum Glassware Prototype: Visitor Experience Exploration for Designing Smart Glasses", "fourth most downloaded article": "Improving Archaeologists’ Online Archive Experiences Through User-Centred Design", "available for download": 158, "sixth most downloaded article": "Integrating a Location-Based Mobile Game in the Museum Visit: Evaluating Visitors’ Behaviour and Learning", "fifth most downloaded article": "The dream of a global knowledge network—A new approach", "publication years": "2008-2017", "seventh most downloaded article": "A serious game model for cultural heritage", "publication count": 158, "journal category": "Journal on Computing and Cultural Heritage (JOCCH)", "tenth most downloaded article": "Families and Mobile Devices in Museums: Designing for Integrated Experiences", "second most downloaded article": "Research challenges for digital archives of 3D cultural heritage models", "total downloads": 65879, "citation count": 304, "journal category_description": ""},
{"ninth most downloaded article": "A Simplified Phase Model for Simulation of Oscillator-Based Computing Systems", "first most downloaded article": "Energy-Efficient and Improved Image Recognition with Conditional Deep Learning", "eight most downloaded article": "A Survey on Chip to System Reverse Engineering", "third most downloaded article": "Guest Editors’ Introduction: Hardware and Algorithms for On-Chip Learning", "fourth most downloaded article": "Stochastic CBRAM-Based Neuromorphic Time Series Prediction System", "available for download": 328, "sixth most downloaded article": "Spin-transfer torque magnetic random access memory (STT-MRAM)", "fifth most downloaded article": "Structured Pruning of Deep Convolutional Neural Networks", "publication years": "2005-2017", "seventh most downloaded article": "Exploiting Idle Hardware to Provide Low Overhead Fault Tolerance for VLIW Processors", "publication count": 328, "journal category": "ACM Journal on Emerging Technologies in Computing Systems (JETC)", "tenth most downloaded article": "Non-Volatile Processor Based on MRAM for Ultra-Low-Power IoT Devices", "second most downloaded article": "Emerging Technology-Based Design of Primitives for Hardware Security", "total downloads": 138798, "citation count": 802, "journal category_description": "The  invites submissions of original technical papers describing research and development in emerging technologies in computing systems. Major economic and technical challenges are expected to impede the continued scaling of semiconductor devices. This has resulted in the search for alternate mechanical, biological/biochemical, nanoscale electronic, asynchronous and quantum computing, and sensor technologies. As the underlying nanotechnologies continue to evolve in the labs of chemists, physicists, and biologists, it has become imperative for computer scientists and engineers to translate the potential of the basic building blocks (analogous to the transistor) emerging from these labs into information systems. Their design will face multiple challenges ranging from the inherent (un)reliability due to the self-assembly nature of the fabrication processes for nanotechnologies, from the complexity due to the sheer volume of nanodevices that will have to be integrated for complex functionality, and from the need to integrate these new nanotechnologies with silicon devices in the same system. The journal provides comprehensive coverage of innovative work in the specification, design analysis, simulation, verification, testing, and evaluation of computing systems constructed out of emerging technologies and advanced semiconductors. Also of interest are innovations in system design for green and sustainable computing, and computing-driven solutions to emerging areas in biotechnology. Topics include, but are not limited to:\r\n\r\n"}
]